Improved diagram in readme
